# GB_Basics_Python_2_4_6_8
Домашняя работа №1 к семинару "Знакомство с языком Python"

Задача 2: Найдите сумму цифр трехзначного числа.

```
n = input("Введите трехзначное число: ")

while len(str(n)) !=3:
    n = input("Вы ошиблись!\nВведите трехзначное число: ")

result = str(int(n[0]) + int(n[1]) + int(n[2]))
print(f"{n} -> {result} ({n[0]} + {n[1]} + {n[2]})") 
```

Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

```
n = int(input("Введите общее количество журавликов: "))

Petya = int(n / 6)
Sereja = Petya
Katya = int((Petya + Sereja) * 2)

print(f"{n} -> {Petya} {Katya} {Sereja} ") 
```

Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером. Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех. Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать программу, которая проверяет счастливость билета.

```
n = input("Введите шестизначное число: ")

while len(str(n)) != 6:
    n = input("Вы ошиблись!\nВведите шестизначное число: ")

if int(n[0]) + int(n[1]) + int(n[2]) == int(n[3]) + int(n[4]) + int(n[5]):
    print(f"{n} -> yes") 
else:
    print(f"{n} -> no") 
```

Задача 8: Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек, если разрешается сделать один разлом по прямой между дольками (то есть разломить шоколадку на два прямоугольника).

```
print("Размер шоколадки: ")
n = int(input("Длина: "))
m = int(input("Ширина: "))
k = int(input("Разделить на количество долек: "))

if k % n == 0 or k % m == 0:
    print(f"{n} {m} {k} -> yes") 
else:
    print(f"{n} {m} {k} -> no")
```
